gpg-generate.org
#+TITLE: generating a gpg key
#+SETUPFILE: setupfile.org

* Curve25519 keys
using ~--full-generate-key --expert~ allows you to use all the hidden
ECC options, including Curve25519

[2022-08-05 Fri]: a word of warning: at the time of writing,
Curve25519 seems to be the only curve-based algorithm that gpg
supports while also being deemed safe by [[https://safecurves.cr.yp.to/][cr.yp.to's safecurves
guidelines]]. DO NOT USE THE OTHER ONES, /ESPECIALLY/ THE NIST AND *DSA
ONES THAT THE NSA BACKDOORED!!!

* remove limitations on uid
annoyingly, gpg enforces a 5 character minimum length for uid's by
default. use ~--allow-freeform-uid~ to disable this behavior

do put an email though, else some keyservers will not accept it

#+begin_quote
"There are two major products that come out of Berkeley: LSD and UNIX.
   We don't believe this to be a coincidence." - Jeremy S. Anderson
#+end_quote
