gpg-generate.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-05 Fri 20:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>generating a gpg key</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<nav>
<a href="index.html">home</a> /
<a href="about.html">about</a> /
<a href="sitemap.html">sitemap</a> /
</nav>
</head>
<body>
<div id="content" class="content">
<h1 class="title">generating a gpg key</h1>

<div id="outline-container-org0000000" class="outline-2">
<h2 id="org0000000"><span class="section-number-2">1.</span> Curve25519 keys</h2>
<div class="outline-text-2" id="text-1">
<p>
using <code>--full-generate-key --expert</code> allows you to use all the hidden
ECC options, including Curve25519
</p>

<p>
<span class="timestamp-wrapper"><span class="timestamp">[2022-08-05 Fri]</span></span>: a word of warning: at the time of writing,
Curve25519 seems to be the only curve-based algorithm that gpg
supports while also being deemed safe by <a href="https://safecurves.cr.yp.to/">cr.yp.to's safecurves
guidelines</a>. DO NOT USE THE OTHER ONES, <i>ESPECIALLY</i> THE NIST AND *DSA
ONES THAT THE NSA BACKDOORED!!!
</p>
</div>
</div>

<div id="outline-container-org0000001" class="outline-2">
<h2 id="org0000001"><span class="section-number-2">2.</span> remove limitations on uid</h2>
<div class="outline-text-2" id="text-2">
<p>
annoyingly, gpg enforces a 5 character minimum length for uid's by
default. use <code>--allow-freeform-uid</code> to disable this behavior
</p>

<p>
do put an email though, else some keyservers will not accept it
</p>

<blockquote>
<p>
"There are two major products that come out of Berkeley: LSD and UNIX.
   We don't believe this to be a coincidence." - Jeremy S. Anderson
</p>
</blockquote>
</div>
</div>
</div>
</body>
</html>
